[
    "! Ну, здорово! Добро пожаловать на борт нашего болотного ледокола!", 
    "! Здравствуйте. Ваш компьютер только что был определен и занесен в спутниковую систему наведения НАТО! У Вас есть 20 секунд что бы покинуть здание! Вы можете оставить свое последнее желание после звукового сигнала... Бииип!!! ",
    ". Идите погуляйте, погода хорошая.",  
    " - это звучит гордо!",  
    ". Ты потратил пять секунд своей жизни читая это", 
    "! Приложите ваш большой палец к экрану для итендификации.", 
    ". Я читаю ваши мысли. Вы думаете о слонах.", 
    "... Вас так зовут. Я уверен, что мы знакомы. Помоему мы где-то встречались.", 
    "! Выпрямитесь и уберите руку из под головы.", 
    "! Не сутультесь.",  
    "! Самая лучшая шляпа - это бумажный пакет.",  
    "! НиКоГдА Не ПиШиТе Так.", 
    "! Есть закурить?",     
    "! Нет... мне не нужна картошка.", 
    "! Чем дальше в лес - тем ниже FPS.", 
    "! А знаете-ли вы, что если сверху посмотреть, то сбоку кажется, что снизу ничего не видно?", 
    "! Konnichiwa!",
    " добро пожаловать! Мы надеемся ты принёс пицу!",
    "! Мы ждали вас!",
    " здесь, как и было предсказано!",
    " только что прибыл. Похоже, он чрезвычайно силён! Пожалуйста, понерфите!",
    " ! Добро пожаловать! Оставь своё оружие у двери!",
    " заспавнился на сервере.",
    " заскочил на сервер.",
    " присоединился к нашей вечеринке!",
    " добро пожаловать! Располагайся и будь как дома, но не забывай, что в гостях!",
    " ! Мы ожидали Вас",
    " просочился на сервер.",
    " только что подключился. Прячьтесь!",
    " только что подключился. Все сделайте вид, что заняты!",
    " пришел. Вечеринка окончена.",
    " здpаствуйте, с вами говоpит пылесос... ой, нет, холодильник... нет... неужели утюг? ... А, вот! Бот! Бииип!!!",
    " здpавствуйте. Вам написал бот автоответчик. Записывающая аппаpатуpа ФСБ будет включена после сигнала... Бииип!!!",
    " здравствуйте. Мы не можем вас сейчас встретить. После гудка, пожалуйста, оставьте Ваше имя, телефон, номеpа счетов Master Card, Visa или American Express, и мы пеpезвоним Вам, если Ваша плетежеспособность подтвеpдится... Бииип!!! ",
    " здравствуйте. С Вами говорит автоответчик. Если у Вас плохие новости - говорите сейчас, если хорошие - дождитесь звукового сигнала.",
    " добро пожаловать отсюда!",
    "! Чё каво бро?",
    ". ромашка, ромашка, я одуванчик! Приём, как слышно!",
    " на проводе, доложите обстановку!",
    ". Мой кот сегодня ходил по клавиатуре и написал твой ник! Я увидел тебя! Ты выделяешься как подснежниксредигвоздик... Ты чист и прекрасен на аватарке. Я пишу тебе... Моё сердце бьётся чаще, а лёгкие сводит судорга... Если ты не ответишь мне **привет** я зарежу своего кота!",
    "! Е..ть мой лысый череп! Кого я вижу?!",
    "! Здаровчинко!",
    " ку",
    "! Как жизнь салага?!",
    " дратути!",
    " здарова! Семки есть?",
    "! Опа! Кто это к нам колёса прикатил?!",
    "! Кря!",
    "! Салам!",
    "! Лопни мои глазеньки! Это кто такой к нам пожаловал?!",
    "! Мяу!",
    "! Я вас алё!",
    "! Часик в радость!",
    "! Кукусики!",
    "! Хаю хай! С вами Ивангай!",
    "! Хакуна матата!",
    "! Наидобрейший вечерочек!",
    "! Приветикус!",
    "! Шалом!",
    "! Привэд!",
    "! Вечер в хату!",
    "! Дратвуй братуха!",
    "! qq",
    "! Прювэээт!",
    "! Подскажите пожалуйста, как пройти прямо?",
    "! Здравия желаю!",
    "! Дороу!",
    "! Оооооо!!! Привеееет!!!",
    "! Сколько лет! Сколько зим!",
    "! Вот это встреча!",
    "! Трям!",
    "! Бонжур!",
    "! Гутентаг!",
    "! Нихао!",
    "! Алоха!",
    "! Добрый день! Неимоверно счастлив лицезреть вас, ибо получаю от общения с вами не только эстетическое, но и моральное, удовольствие, ибо моя радость от очередной возможности общения с вами превышает все возможные пределы!",
    "! Хело!",
    "! Хелоу!",
    "! Хола!",
    "! Доровки!",
    "! Добрый вечер! Я диспетчер!",
    "! Как житуха братуха?!",
    "! Салют!",
    "! А у тебя сексуальные брови! Давай дружить?!",
    "! Эй ти дарова!",
    "! Что то против имеешь на счёт первого приветствия?!"

]